"""
В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно. 
Определите и запишите в ответе сначала количество пар элементов последовательности, 
в которых оба числа оканчиваются или на 3, или на 5 (можно неодновременно), затем максимальную из сумм элементов таких пар. 
В данной задаче под парой подразумевается два подряд идущих элемента последовательности. 
Например для последовательности из пяти элементов: 3; 15; 25; -3; 4 - ответ 3 40.
"""
k = 3 
print(k)
